SET search_path TO lab_drug_store;

-- микстура от кашля
INSERT INTO "Рецептуры" (Formula_id, "Этап", "Количество", "Технологическая_карта", "Компоненты")
VALUES
    (1, 'Смешивание', 30.0, 1, 6), -- Сироп глюкозы
    (2, 'Смешивание', 5.0, 1, 5), -- Экстракт алтея
    (3, 'Добавление', 100.0, 1, 1); -- Вода дистиллированная

-- ланолиновая мазь
INSERT INTO "Рецептуры" (Formula_id, "Этап", "Количество", "Технологическая_карта", "Компоненты")
VALUES
    (4, 'Расплавление', 50.0, 2, 3),
    (5, 'Добавление', 20.0, 2, 2),
    (6, 'Добавление', 30.0, 2, 1);

-- раствор перекиси водорода
INSERT INTO "Рецептуры" (Formula_id, "Этап", "Количество", "Технологическая_карта", "Компоненты")
VALUES
    (7, 'Смешивание', 30.0, 3, 7),
    (8, 'Смешивание', 70.0, 3, 1);