SET search_path TO lab_drug_store;

TRUNCATE TABLE
    "Поставщики",
    "Компоненты",
    "Больные_клиенты",
    "Лекарства",
    "Готовые_лекарства",
    "Изготавливаемые_лекарства",
    "Технологические_карты",
    "Рецептуры",
    "Заявки_на_пополнение_компонентов",
    "Заявки_на_пополнение_готовых_лека",
    "Партии_компонентов",
    "Рецепты",
    "Заказы",
    "Резерв_компонентов"
    RESTART IDENTITY CASCADE;



INSERT INTO "Поставщики" (Supplier_id, Full_name, Phone, Email)
VALUES
    (1, 'Поставщик 1', '+88005553535', 'info@ferma.ru'),
    (2, 'Поставщик 2', '+79137081988', 'm.sorkin3@g.nsu.ru');

INSERT INTO "Больные_клиенты" (Client_id, "ФИО", "Телефон", "Адрес")
VALUES
    (1, 'Иванов Иван Иванович', '+79001234567', 'г. Москва'),
    (2, 'Петрова Анна Сергеевна', '+79111234567', 'г. Санкт-Петербург'),
    (3, 'Сидоров Петр Николаевич', '89221234567', 'г. Новосибирск');

INSERT INTO "Лекарства" (Medicine_id, "Название", "Тип", "Способ_применения", "Цена")
VALUES
    (1, 'Парацетамол таблетки', 'готовое', 'внутреннее', 150.00);

INSERT INTO "Готовые_лекарства" (Medicine_id, "Производитель", "Форма_выпуска")
VALUES
    (1, 'Фармстандарт', 'таблетки');

INSERT INTO "Рецепты" (Prescription_id, "Диагноз", "Наименование_лекарства", "Способ_применения",
                       "Дата_выписки", "Количество_лекарства", "ФИО_врача", "Подпись_врача", "Печать_врача", Client_id)
VALUES
    (1, 'Грипп', 'Парацетамол таблетки',
     'По 1 таблетке 3 раза в день', '2026-03-01', 20,
     'Петров П.П.', 'Подпись A', 'Печать A', 1),
    (2, 'Головная боль', 'Парацетамол таблетки',
     'По 1 таблетке при необходимости', '2026-03-05', 10,
     'Сидорова А.И.', 'Подпись Б', 'Печать Б', 2),
    (3, 'Простуда', 'Парацетамол таблетки',
     'По 1 таблетке 2 раза в день', '2026-03-10', 20,
     'Иванова Е.В.', 'Подпись В', 'Печать В', 3);

INSERT INTO "Заказы" (Order_id, "Дата_создания", "Статус", "Время_изготовления", "Цена", Medicine_id, Prescription_id)
VALUES
    (1, '2026-03-02 10:00:00', 'выполнен',
     '2026-03-02 11:00:00', 150.00, 1, 1),
    (2, '2026-03-06 14:30:00', 'выполнен',
     '2026-03-06 15:30:00', 150.00, 1, 2),
    (3, '2026-03-12 09:15:00', 'выполнен',
     '2026-03-12 10:15:00', 150.00, 1, 3);



-- 5.	Получить перечень и общее число покупателей, заказывавших определенное лекарство
-- или определенные типы лекарств за данный период.
SELECT DISTINCT
    bc.Client_id AS ID_клиента,
    bc."ФИО" AS ФИО,
    bc."Телефон" AS Телефон,
    bc."Адрес" AS Адрес
FROM "Заказы" AS o
    JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    JOIN "Больные_клиенты" AS bc ON r.Client_id = bc.Client_id
WHERE o.Medicine_id = 1
  AND o."Дата_создания" BETWEEN '2026-03-01' AND '2026-03-07';

-- общее число покупателей
SELECT COUNT(DISTINCT bc.Client_id) AS Количество_покупателей
FROM "Заказы" AS o
    JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    JOIN "Больные_клиенты" AS bc ON r.Client_id = bc.Client_id
WHERE o.Medicine_id = 1
  AND o."Дата_создания" BETWEEN '2026-03-01' AND '2026-03-07';

SELECT DISTINCT
    bc.Client_id AS ID_клиента,
    bc."ФИО" AS ФИО,
    bc."Телефон" AS Телефон,
    bc."Адрес" AS Адрес
FROM "Заказы" AS o
    JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    JOIN "Больные_клиенты" AS bc ON r.Client_id = bc.Client_id
    JOIN "Лекарства" AS l ON o.medicine_id = l.medicine_id
WHERE l."Тип" = 'изготавливаемое' AND o."Дата_создания" BETWEEN '2026-03-01' AND '2026-03-07';