SET search_path TO lab_drug_store;

TRUNCATE TABLE
    "Поставщики",
    "Компоненты",
    "Больные_клиенты",
    "Лекарства",
    "Готовые_лекарства",
    "Изготавливаемые_лекарства",
    "Технологические_карты",
    "Рецептуры",
    "Заявки_на_пополнение_компонентов",
    "Заявки_на_пополнение_готовых_лека",
    "Партии_компонентов",
    "Рецепты",
    "Заказы",
    "Резерв_компонентов"
    RESTART IDENTITY CASCADE;



INSERT INTO "Поставщики" (Supplier_id, Full_name, Phone, Email)
VALUES
    (1, 'Поставщик 1', '+88005553535', 'info@ferma.ru'),
    (2, 'Поставщик 2', '+79137081988', 'm.sorkin3@g.nsu.ru');

INSERT INTO "Больные_клиенты" (Client_id, "ФИО", "Телефон", "Адрес")
VALUES
    (1, 'Иванов Иван Иванович', '+79001234567', 'г. Москва'),
    (2, 'Петрова Анна Сергеевна', '+79111234567', 'г. Санкт-Петербург');

INSERT INTO "Лекарства" (Medicine_id, "Название", "Тип", "Способ_применения", "Цена")
VALUES
    (1, 'Парацетамол таблетки', 'готовое', 'внутреннее', 150.00);

INSERT INTO "Готовые_лекарства" (Medicine_id, "Производитель", "Форма_выпуска")
VALUES
    (1, 'Фармстандарт', 'таблетки');

INSERT INTO "Рецепты" (Prescription_id, "Диагноз", "Наименование_лекарства", "Способ_применения", "Дата_выписки",
                       "Количество_лекарства", "ФИО_врача", "Подпись_врача", "Печать_врача", Client_id)
VALUES
    (1, 'Грипп', 'Парацетамол таблетки',
     'По 1 таблетке 3 раза в день', '2026-03-10',
     20, 'Петров П.П.', 'Подпись A', 'Печать A', 1),

    (2, 'Кашель', 'Микстура от кашля',
     'По 1 столовой ложке 3 раза в день', '2026-03-11',
     1, 'Сидорова А.И.', 'Подпись Б', 'Печать Б', 2);

ALTER TABLE "Заказы" DISABLE TRIGGER trg_set_order_initial_status;

INSERT INTO "Заказы" (Order_id, "Дата_создания", "Статус", "Время_изготовления", "Цена", Medicine_id, Prescription_id)
VALUES
    (1, '2026-03-10 10:00:00', 'в производстве',
     NULL, 150.00, 1, 1),
    (2, '2026-03-11 12:00:00', 'выполнен',
     '2026-03-11 13:00:00', 150.00, 1, 2);

ALTER TABLE "Заказы" ENABLE TRIGGER trg_set_order_initial_status;




-- 8.	Получить полный перечень и общее число заказов находящихся в производстве.
SELECT
    o.Order_id AS ID_заказа,
    o."Статус" AS Статус_заказа,
    o."Дата_создания" AS Дата_создания,
    l."Название" AS Лекарство,
    bc."ФИО" AS ФИО_клиента
FROM "Заказы" AS o
    JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    JOIN "Больные_клиенты" AS bc ON r.Client_id = bc.Client_id
    JOIN "Лекарства" AS l ON o.Medicine_id = l.Medicine_id
WHERE o."Статус" = 'в производстве'
ORDER BY "Дата_создания";

-- общее число заказов в состоянии 'в производстве'
SELECT COUNT(*) AS "Количество заказов в производстве"
FROM "Заказы" AS o
WHERE o."Статус" = 'в производстве';