SET search_path TO lab_drug_store;

TRUNCATE TABLE
    "Поставщики",
    "Компоненты",
    "Больные_клиенты",
    "Лекарства",
    "Готовые_лекарства",
    "Изготавливаемые_лекарства",
    "Технологические_карты",
    "Рецептуры",
    "Заявки_на_пополнение_компонентов",
    "Заявки_на_пополнение_готовых_лека",
    "Партии_компонентов",
    "Рецепты",
    "Заказы",
    "Резерв_компонентов"
    RESTART IDENTITY CASCADE;



INSERT INTO "Поставщики" (Supplier_id, Full_name, Phone, Email)
VALUES
    (1, 'Поставщик 1', '+88005553535', 'info@ferma.ru'),
    (2, 'Поставщик 2', '+79137081988', 'm.sorkin3@g.nsu.ru');

INSERT INTO "Больные_клиенты" (Client_id, "ФИО", "Телефон", "Адрес")
VALUES
    (1, 'Иванов Иван Иванович', '+79001234567', 'г. Москва'),
    (2, 'Петрова Анна Сергеевна', '+79111234567', 'г. Санкт-Петербург');

INSERT INTO "Лекарства" (Medicine_id, "Название", "Тип", "Способ_применения", "Цена")
VALUES
    (1, 'Парацетамол таблетки', 'готовое', 'внутреннее', 150.00),
    (2, 'Ибупрофен таблетки', 'готовое', 'внутреннее', 200.00);

INSERT INTO "Готовые_лекарства" (Medicine_id, "Производитель", "Форма_выпуска", "Остаток")
VALUES
    (1, 'Фармстандарт', 'таблетки', 100),
    (2, 'Нижфарм', 'таблетки', 50);

INSERT INTO "Рецепты" (Prescription_id, "Диагноз", "Наименование_лекарства", "Способ_применения",
                       "Дата_выписки", "Количество_лекарства", "ФИО_врача", "Подпись_врача", "Печать_врача", Client_id)
VALUES
    (1, 'Грипп', 'Парацетамол таблетки',
     'По 1 таблетке 3 раза в день', '2026-03-01', 20,
     'Цыганков П.П.', 'Подпись A', 'Печать A', 1),

    (2, 'Острая боль', 'Ибупрофен таблетки',
     'По 1 таблетке при боли', '2026-03-02', 10,
     'Сидорова А.И.', 'Подпись Б', 'Печать Б', 2),

    (3, 'Головная боль', 'Парацетамол таблетки',
     'По 1 таблетке 2 раза в день', '2026-03-03', 15,
     'Сорокина Е.В.', 'Подпись В', 'Печать В', 1);

ALTER TABLE "Заказы" DISABLE TRIGGER trg_set_order_initial_status;

INSERT INTO "Заказы" (Order_id, "Дата_создания", "Статус", "Время_изготовления", "Цена", Medicine_id, Prescription_id)
VALUES
    (1, '2026-03-02 10:00:00', 'в производстве',
     NULL, 150.00, 1, 1),
    (2, '2026-03-03 12:00:00', 'в производстве',
     NULL, 200.00, 2, 2),
    (3, '2026-03-04 09:00:00', 'выполнен',
     '2026-03-04 10:00:00', 150.00, 1, 3);

ALTER TABLE "Заказы" ENABLE TRIGGER trg_set_order_initial_status;



-- 9.	Получить полный перечень и общее число препаратов требующихся для заказов, находящихся в производстве.

-- препараты для заказов в статусе 'в производстве'
WITH orders_in_production AS (
    SELECT
        o.Order_id,
        o.Medicine_id,
        r."Количество_лекарства" AS Требуемое_количество
    FROM "Заказы" AS o
        JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    WHERE o."Статус" = 'в производстве'
)
SELECT
    oi.Order_id AS Номер_заказа,
    l."Название" AS Лекарство,
    oi.Требуемое_количество AS "Количество, ед."
FROM orders_in_production AS oi
    JOIN "Лекарства" AS l ON oi.Medicine_id = l.Medicine_id
ORDER BY Номер_заказа;

-- уникальные препараты и их общее к-во в производстве
SELECT
    o.order_id as Номер_заказа,
    l.medicine_id as ID_препарата,
    l."Название" AS Лекарство,
    SUM(r."Количество_лекарства") AS "Всего требуется, ед."
FROM "Заказы" AS o
    JOIN "Рецепты" AS r ON o.Prescription_id = r.Prescription_id
    JOIN "Лекарства" AS l ON o.Medicine_id = l.Medicine_id
WHERE o."Статус" = 'в производстве'
GROUP BY Номер_заказа, ID_препарата, Лекарство
ORDER BY "Всего требуется, ед." DESC;