SET search_path TO lab_drug_store;

TRUNCATE TABLE
    "Поставщики",
    "Компоненты",
    "Больные_клиенты",
    "Лекарства",
    "Готовые_лекарства",
    "Изготавливаемые_лекарства",
    "Технологические_карты",
    "Рецептуры",
    "Заявки_на_пополнение_компонентов",
    "Заявки_на_пополнение_готовых_лека",
    "Партии_компонентов",
    "Рецепты",
    "Заказы",
    "Резерв_компонентов"
    RESTART IDENTITY CASCADE;



-- 11.	Получить сведения о ценах на указанное лекарство в готовом виде,
-- об объеме и ценах на все компоненты, требующиеся для этого лекарства.
SELECT
    l.Medicine_id,
    l."Название" AS "Лекарство",
    l."Цена" AS "Цена лекарства, руб.",

    c.Component_id,
    c.Name AS "Компонент",
    c.price AS "Цена компонента, руб./ед.",

    r."Количество" AS "Требуемый объем на единицу лекарства",
    (r."Количество" * c.price) AS "Стоимость на единицу лекраства, руб."
FROM "Лекарства" AS l
    JOIN "Технологические_карты" AS t ON l.Medicine_id = t.Medicine_id
    JOIN "Рецептуры" AS r ON t.Technology_id = r."Технологическая_карта"
    JOIN "Компоненты" AS c ON r."Компоненты" = c.Component_id
WHERE l.Medicine_id = 4 -- указать ID изготавливаемого лекарства
ORDER BY l.medicine_id, c.Component_id;